app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2018-10-16 21:28:53.491171"], ["id", 3]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(title: params['post']['title'], description: params['post']['description'])